[
  "A mighty monster in Mist Valley, and the ultimate weapon designed from Claiomh Solias. Its surprise attacks from above baffle invaders.",
  "A fallen fairy that is powerful in the dark.",
  "A destructive machine discovered in the Ruins of the Ancients.",
  "An expert at battle who belongs to a crack diabolical unit. He's famous because he always gets the job done.",
  "This warrior blindly swings a deadly blade with devastating force.",
  "An aristocrat who wields a sword possessed by a malicious spirit that preys on the weak.",
  "Only the master of the sword among Fiend-Type monsters is permitted to hold the Talwar.",
  "A dragon that dwells in the depths of darkness, its vulnerability lies in its poor eyesight.",
  "Constructed from several components, this monster can launch them in a pincer attack.",
  "A freight car that is exclusively for Dekoichi. It can transport anything, but most cargo arrives broken.",
  "Stretching arms and razor-sharp claws make this monster a formidable opponent.",
  "A clown revived by the powers of darkenss. Its deadly dance has sent many monster to their graves.",
  "A zombie shark that can deliver its lethal curse with a spell.",
  "Queen of the galaxies and mistress of the stars.",
  "A wicked dragon that taps into dark forces to execute a powerful attack.",
  "A mechanical soldier that won't stop attacking until all of its life readings have been extinguished from its sensors.",
  "A poor goblin that was sucked into a different dimension. However, he's doing his best with his new destiny.",
  "Armed with the Psycho Sword, this sinister assassin rules the bad land.",
  "They say he is a dragon-manipulating warrior from the dark world. His attack is tremendous, using his great swords with vicious power.",
  "It's said that this King of the Netherworld once had the power to rule over the dark.",
  "The ultimate wizard in terms of attack and defense.",
  "He leaps up, down, and all around! Nobody can lay a hand on this funny bunny.",
  "A fiend said to dwell in the world of dreams, it attacks enemies in their sleep.",
  "A monstrous creature whose body is lined with cannons that never miss their targets.",
  "This monster hides in a saucer and only appears when executing an attack.",
  "This fairy rules over the end of existence.",
  "A dragon revived by sorcery. Its breath is highly corrosive.",
  ".ytilaer a maerd rieht ekam thgim yeht taht os ydob a rof gninraey ,sluos mrawsleetS",
  "\"!etanimretxE !etacidarE !etanimilE\"",
  "A playful little fiend that lurks in the dark, waiting to attack an unwary enemy.",
  "An indestructible mechanoid created for the sole purpose of guarding the gateways.",
  "A massive steel ball that mows down anything in its path.",
  "This steel-armored terror machine ruthlessly strikes down enemies with its giant katana.",
  "A Goblin who devotes himself to mastering perfect calligraphy of the word \"False\". He gives his all to each stroke.",
  "A masked monster that wields the most deadly of curses.",
  "This dragon has taken down countless prey with its sharp fangs. It strikes very quickly, because if it does not to a counter-attack.",
  "Manipulates enemy attacks with the power of illusion.",
  "He yoozes both a physical form and a shadow form ta attack. So he's a tough monstah ta beat!",
  "A fiend that dwells in a blinding curtain of smoke.",
  "Wields the power of darkness to destroy its enemies.",
  "A vicious, fire-breathing dragon whose wicked flame corrupts the souls of its victims.",
  "A workaholic fiend who devotes everything to his research into the languages of Dark World. His mind has collapsed because of working too hard.",
  "A genie of the lamp that is at the beck and call of its master.",
  "A forbidden left arm sealed by magic. Whosoever breaks this seal will know infinite power.",
  "A forbidden left leg sealed by magic. Whosoever breaks this seal will know infinite power.",
  "This spirit emerges from the mystic lamp and obeys the wishes of its summoner.",
  "He used to be a normal dog who played around in a park, but was corrupted by the powers of darkness.",
  "This creature casts a spell of terror and confusion just before attacking its enemies.",
  "A monster disguised as a treasure chest that is known to attack the unwary adventurer.",
  "A cyborg snail that still travels at a slow place.",
  "A hunter that relentlessly pursues its target by order of the Machine King.",
  "An eyeball fiend created by a servant of the wicked, it uses \"Dark Bombs\" to blow away its enemies.",
  "Made of mysterious metal, this monster is a doomsday machine from the edge of the universe.",
  "This monster has four different masks for four different attacks.",
  "A fiend guarding the treasures of the netherworld, it's most at home in the dark.",
  "A dragon warrior of the moon armed with a crescent sword.",
  "A strange fiend with long arms and razor sharp talons.",
  "Mysterious living matter that suddenly appeared from a different dimension. Its attack paralyzes the target's nerves, and causes intense hallucinations.",
  "Nothing can stop the mad attack of this powerful creature.",
  "The one-eyed Necrolancer launches his onslaught from a dimensional ring that can appear out of thin air.",
  "A child-like creature that controls a sleep fiend to beckon enemies into eternal slumber.",
  "A one-eyed giant that serves the \"Dark Ruler Ha Des\", it skewers its enemies with its sharp horn, shattering them to pieces.",
  "A horrible torture machine with a large pendulum blade.",
  "An apparition of those said to formerly serve the Pharaoh. It has tremendous loyalty that does not waiver.",
  "A ferocious dragon with a deadly attack.",
  "His renowned athletic physique has made him famous with the populace of Dark World. They call him \"Iron Wall Renge\" because no one can break through his incredible defenses.",
  "A forbidden right arm sealed by magic. Whosoever breaks this seal will know infinite power.",
  "A forbidden right leg sealed by magic. Whosoever breaks this seal will know infinite power.",
  "A very elusive creature that looks like a harmless statue until it attacks.",
  "This clown appears from nowhere and executes very strange moves to avoid enemy attacks.",
  "Soldiers equipped with state-of-the-art weaponry to face unknown creatures.",
  "One of the few people who has a good command of Talismans. His history is a mystery.",
  "This wizard worships the darkness, and is served by a sinister hand that drags its enemies into oblivion.",
  "A dragon created from the soul of a wicked knight.",
  "A bow tie with horrible power, it attacks an opponent by controlling others.",
  "A skeletal ghost that isn't strong, but can mean trouble in large numbers.",
  "Foist he's gonna grab yer monstah wit' his claws, den attack again wit' his poizin stingah!",
  "The machine's ability is said to vary according to its slot results.",
  "A slave of the dark arts, this sorcerer is a master of death-dealing spells.",
  "A wicked spirit created by the hateful souls of those who fell in battle. It grows by assimilating the souls of its enemies.",
  "A mechanical soldier created by a wicked sorcerer, it attacks with the two steel balls attached to its arms.",
  "A warrior wizard adept in casting bone-chilling spells.",
  "A fiend with dark powers for confusing the enemy. Among the Fiend-Type monsters, this monster boasts considerable force."
]
